{
    "Home": {
        "title": "bonjour et bienvenue je suis",
        "subtitle": "Développeur web passionné, je conçois des solutions digitales efficaces et esthétiques, pensées pour vos besoins",
        "completed_projects" : "projets accomplis",
        "years_experience": "années d'expérience",
        "all_projects": "tous mes projets",
        "need": "besoin d'une",
        "interface": "interface",
        "service_desc": "Développeur depuis 5 ans, je transforme les idées en projets concrets… même les plus fous.",
        "crafting_interactive_interfaces": "Creation d’interfaces interactives",
        "responsive_designs": "Designs responsives et pixel-perfect",
        "animations_micro_interactions": "Animations et micro-interactions",
        "accessibility_approach": "Accessibilité au cœur du design",
        "application_pwa": "PWA",
        "offline_fast": "Offline-first et chargement rapide",
        "push_notifications": "Notifications push et mises à jour en temps réel",
        "cross_platform": "Cross-platform (iOS & Android)",
        "back_end": "Systemes robustes et scalables",
        "api_microservices": "APIs et microservices",
        "database_design": "Conception et optimisation de bases de données",
        "authentication_security": "Authentification et sécurité",
        "about_me": "A propos de moi"

    }, "locale": {
        "fr": "français",
        "en": "anglais"
    },
    "Common" : {
        "about": "À propos",
        "projects": "Projets",
        "contact": "Contact"
    },
    "Project" : {
        "other_projects": "Autres projets",
        "mobile_app": "application mobile",
        "pwa": "PWA",
        "tool": "outil",
        "companion_app": "application companion",
        "my": "mes",
        "projects": "projets",
        "subtitle": "Découvrez ici mes projets majeurs des dernières années, soigneusement organisés",
         "web_app": "Application web",
        "frontend": "Frontend",
        "payroll": "Gestion de paie",
        "business_application": "Application métier",
        "react": "React",
        "backoffice": "backoffice",
        "3d_visualization": "Visualisation 3D",
        "showcase_website": "Site vitrine",
        "e-commerce": "E-commerce",
        "thelia": "thelia",
        "fullstack": "fullstack",
        "ionic_capacitor": "Ionic / Capacitor",
        "remix": "Remix",
        "tailwind": "Tailwind css",
        "storybook": "Storybook",
        "docker": "Docker",
        "vtkjs": "VTK.js",
        "nextjs": "Next.js",
        "php": "PHP",
        "html": "HTML5 & CSS3",
        "js": "JavaScript / TypeScript",
        "vuejs": "Vue.js",
        "expressjs": "Express.js",
        "tags": "Tags",
        "recap": "Recap",
        "stack": "Stack Projet",
        "description1": "Le projet ARS Normandie est une application métier de gestion de la paie, développée en collaboration étroite avec un développeur backend.\n\nJ’ai réalisé l’intégralité de la partie frontend, en concevant une interface robuste et ergonomique adaptée à des besoins métiers complexes.\n\nL’application permet de simuler les salaires d’agents selon différents statuts : contractuels, détachés sur contrat, titulaires, et relevant du régime général de la fonction publique.\nElle s’appuie sur de grands formulaires dynamiques permettant de saisir l’ensemble des informations nécessaires à la gestion d’un futur salarié, avec des règles de calcul et de validation spécifiques.\n\nUne partie importante de l’application est dédiée aux évaluations annuelles.\nCes évaluations, réalisées pour l’ensemble des responsables, conditionnent l’attribution de primes et nécessitent des workflows précis, une gestion fine des droits et une fiabilité élevée des données.\n\nL’application intègre également la génération automatique de contrats et d’avenants au format PDF, des outils de statistiques, un système d’authentification ainsi que la gestion de plusieurs niveaux d’utilisateurs.",
        "description2": "Cette application est une PWA companion d’un backoffice dédié à la gestion de parc de véhicules (tracteurs, semi-remorques et porteurs).\n\nElle permet aux chauffeurs de réaliser une inspection complète du véhicule avant de prendre la route, en effectuant un état des lieux détaillé.\nL’utilisateur peut renseigner les éventuels dommages, anomalies techniques ou manquements aux règles d’hygiène directement depuis l’application.\n\nLes informations saisies sont ensuite remontées en temps réel vers le backoffice, permettant aux équipes de gestion de suivre l’état du parc, d’anticiper les opérations de maintenance et d’assurer la conformité et la sécurité des véhicules.\n\nL’application a été conçue selon une approche mobile-first, avec un fort accent mis sur la simplicité d’utilisation, la rapidité d’exécution et la fiabilité des données collectées sur le terrain.",
        "description3": "Solveo est une application web permettant de gérer la configuration et le pilotage automatisé de panneaux solaires installés au-dessus de cultures agricoles.\n\nElle offre une interface de supervision complète pour suivre et ajuster le comportement des panneaux en fonction des besoins des cultures et des conditions environnementales.\n\nL’application intègre un système d’authentification ainsi qu’une large partie dédiée aux statistiques et à la visualisation de données.\nCes indicateurs concernent à la fois les cultures et les panneaux solaires, comme l’inclinaison des panneaux, la température, la pluviométrie, ainsi que d’autres paramètres environnementaux.\n\nCe projet met en avant des problématiques de gestion de données en temps réel, de visualisation claire d’indicateurs complexes et de fiabilité des systèmes automatisés dans un contexte agricole.",
        "description4": "Cette application est une PWA réalisée pour l’entreprise Atelier 3S, permettant la consultation d’un catalogue de bardage métallique.\n\nL’application propose une navigation simple et intuitive à travers les différentes gammes de produits, avec une mise en avant claire des caractéristiques et des visuels.\n\nUne minimap interactive permet de visualiser les différentes réalisations et projets associés aux produits, facilitant l’exploration et l’inspiration.\n\nL’application est connectée à une API développée sous WordPress, assurant la récupération dynamique des données produits et des réalisations, tout en garantissant une mise à jour centralisée du contenu.",
        "description5": "Cet outil a été développé sous forme de Proof of Concept pour l’AP-HP, permettant la superposition de fichiers 3D et la visualisation de données médicales.\n\nL’application utilise VTK.js pour afficher les organes et mettre en surbrillance les zones cancéreuses. Les utilisateurs peuvent fournir des fichiers en entrée et obtenir une visualisation 3D des éléments annotés.\n\nLe frontend est connecté à un backend qui traite les fichiers sources et génère les fichiers de visualisation au format VTK.js (.nii), permettant une exploration interactive et précise des données médicales.\n\nCe projet met en avant des problématiques de traitement de données 3D, de rendu interactif et de collaboration frontend/backend dans un contexte sensible et scientifique.",
        "description6": "Ce projet consiste en un site vitrine one-page réalisé pour un ostéopathe, présentant ses services, son parcours et ses coordonnées.\n\nLe site permet aux visiteurs de consulter facilement les prestations et de prendre contact directement avec le cabinet.\n\nL’accent a été mis sur une interface claire, responsive et agréable à parcourir, adaptée à une expérience utilisateur simple et directe.\n\nCe projet met en avant la création rapide d’un site web professionnel et accessible, avec un design moderne et épuré.",
        "description7": "Ce projet est un site e-commerce pour la vente de manuels et livres de musique pour l’entreprise Billaudot.\n\nMon intervention a porté sur la TMA (Tierce Maintenance Applicative) : débogage, correction de bugs et ajout de petites fonctionnalités pour améliorer l’expérience utilisateur.\n\nLe projet met en avant la maintenance et l’évolution d’une plateforme commerciale existante, en garantissant sa stabilité et sa fiabilité pour les utilisateurs.",
        "description8": "Ce projet est un site e-commerce pour la vente de pots de fleurs pour l’entreprise Jardin Mado.\n\nJ’ai participé à la création du Storybook afin de documenter et standardiser les composants UI pour le projet.\nJ’ai également intégré plusieurs fonctionnalités pendant le développement, contribuant à l’enrichissement et à l’évolution de la plateforme.\n\nLe projet met en avant la mise en place de bonnes pratiques frontend et la contribution directe au développement d’une plateforme commerciale moderne.",
        "description9": "Kalkin est une entreprise qui crée un logiciel de visualisation de territoire en 3D, mettant en évidence les points d’intérêt tels que les randonnées, activités et autres attractions, à destination des offices de tourisme.\n\nJ’ai travaillé en tant que développeur fullstack sur le projet, en collaboration avec un autre développeur, pour réaliser le backoffice permettant le pilotage et la gestion à distance du contenu de l’application Kalkin Tourisme.\n\nLe projet met en avant la gestion de données complexes et la collaboration technique pour développer une solution complète de pilotage de contenu touristique.",
        "description10": "Pour l’entreprise Kalkin, j’ai réalisé une série d’outils internes destinés à faciliter la vie de l’entreprise et optimiser ses process.\n\nJe suis intervenu en tant que **développeur fullstack**, contribuant à la conception et au développement de ces outils.\n\nLe projet met en avant l’amélioration de l’efficacité opérationnelle et la création de solutions internes sur mesure adaptées aux besoins de l’entreprise."
    },
    "About": {
        "title": "Theo, 26 ans",
        "subtitle": "Developpeur web",
        "description1": "Je suis développeur web par passion autant que par métier. J’aime créer des choses utiles, donner vie à des idées et transformer un besoin parfois flou en une application claire, fonctionnelle et agréable à utiliser. Ce qui me motive au quotidien, ce n’est pas seulement d’écrire du code, mais de construire des expériences qui ont du sens",
        "description2": "J’ai commencé le développement par curiosité, et cette curiosité ne m’a jamais quitté. J’aime comprendre comment les choses fonctionnent, explorer de nouvelles technologies et améliorer constamment ma manière de travailler. Que ce soit sur une interface, une logique métier ou une architecture globale, je prends le temps de réfléchir, de tester et d’itérer jusqu’à obtenir un résultat dont je suis fier. Au fil des projets, j’ai appris à être polyvalent : front-end, back-end, web, mobile…",
        "description3": "En dehors du code, je m’investis dans des projets personnels et associatifs, notamment dans le sport, qui m’ont appris des valeurs essentielles comme l’esprit d’équipe, la rigueur et la persévérance. Ces expériences influencent directement ma façon de travailler : j’aime avancer ensemble, partager, et construire sur la durée",
        "stack": "Stack technique &",
        "skills": "soft skills",
        "stack_desc": "Technologies, outils et méthodes que j’utilise pour concevoir des applications web et mobiles modernes, accompagnées des compétences humaines essentielles au travail en équipe et à la réussite des projets.",  
        "js_ts": "JavaScript / TypeScript",
        "html_css": "HTML5 & CSS3",
        "react": "React",
        "ionic_capacitor": "Ionic / Capacitor",
        "next_remix": "Next.js / Remix.js",
        "tailwind": "Tailwind css",
        "git": "Git",
        "docker": "Docker",
        "ci_cd": "CI/CD",
        "terminal_bash": "Terminal / Bash",
        "figma": "Figma / Prototypage",
        "rest_api": "API REST",
        "graphql": "GraphQL",
        "authentication": "Authentification",
        "responsive_design": "Responsive Design",
        "ui_ux": "UI / UX",
        "debug_optimization": "Debug & Optimisation",
        "web_apps": "Applications Web",
        "mobile_apps": "Applications Mobiles",
        "dashboards": "Dashboards",
        "internal_tools": "Outils internes",
        "teamwork": "Travail en équipe",
        "autonomy": "Autonomie",
        "problem_solving": "Résolution de problèmes",
        "communication": "Communication",
        "learning_quickly": "Apprentissage rapide",
        "basic": "Bases",
        "intermediate": "Intermédiaire",
        "advanced": "Avancé",
        "skills_technologies": "Competences techniques",
        "tools_workflow": "Outils & workflow",
        "api_integration": "API & integration",
        "ux_design": "UX / Design",
        "projects_type": "Types de projets",
        "skills_soft": "Soft skills",
        "all_projects": "tous mes projets",
        "cv": "MON CV"

    },
    "Contact" : {
        "me": "me",
        "contact_me": "contacter",
        "description": "Vous avez un projet web, une mission ou une idée à concrétiser ? Décrivez-moi votre besoin via ce formulaire : contexte, objectifs, délais…\n Je reviendrai vers vous rapidement.",
        "name": "Nom",
        "mail": "Email",
        "message": "Message",
        "validation": "J’accepte que mes données soient utilisées uniquement pour me recontacter dans le cadre de cette prise de contact.",
        "send": "envoyer",
        "sending": "envoie",
        "success":"Message envoyé",
        "error":"Une erreur est survenue, réessaie plus tard."
    },
    "Footer" : {
        "box_title_1": "Vous avez une idee ou un",
        "box_title_2": "projet en tete",
        "box_desc": "Faites le premier pas dès maintenant",
        "contact_me": "Contactez moi",
        "right": " © 2026 Tous droits réservés. Code par Theo CHERBLANC",
        "mentions": "Mentions légales"
    },
    "Mentions": {
        "legal": "mentions",
        "notice": "legales",
        "publisher": "Editeur du site",
        "hosting": "Hebergement",
        "intellectual_property": "Propriete intellectuelle",
        "intellectual_property_text": "L’ensemble du contenu présent sur ce site (textes, images, projets, logos, illustrations, code, etc.) est la propriété exclusive de Theo Cherblanc, sauf mention contraire.\n\nToute reproduction, représentation, modification, publication ou adaptation, totale ou partielle, du contenu du site, par quelque procédé que ce soit, est interdite sans autorisation écrite préalable.",
        "cookies": "Cookies et statistiques",
        "cookies_text": "Ce site utilise des outils de mesure d’audience afin d’analyser le trafic et d’améliorer l’expérience utilisateur.\n\nCes outils peuvent utiliser des cookies ou technologies similaires.\nVous pouvez refuser ou configurer les cookies via les paramètres de votre navigateur.",
        "siren_number": "Numéro SIREN",
        "name": "Nom",
        "address": "Address",
        "status": "Statut",
        "activity":"Activité",
        "phone":"Téléphone",
        "email":"Email",
        "hosted_by": "Le site est hébérgé par :",
        "website": "Site web"
    },
    "Metadata" : {
        "layout_title" : "Theo Cherblanc – Développeur web & portfolio",
        "layout_description" : "Découvrez les projets et réalisations de Theo Cherblanc, développeur web spécialisé en applications web modernes et expériences utilisateur.",
        "projects_title" : "Projets – Theo Cherblanc, développeur web",
        "projects_description" : "Découvrez les projets réalisés par Theo Cherblanc : applications web, interfaces interactives et solutions digitales créatives."
    }
}